In [1]:
from functions import Schedule

In [3]:
Schedule(1990)

           Date Home Away PTS_home PTS_away
0    1989-11-03  ATL  IND      103      126
1    1989-11-03  BOS  MIL      127      114
2    1989-11-03  CHH  WSB       96      116
3    1989-11-03  CHI  CLE      124      119
4    1989-11-03  DAL  LAL       94      102
...         ...  ...  ...      ...      ...
1102 1990-04-22  DET  CHI      111      106
1103 1990-04-22  DEN  MIN      115      108
1104 1990-04-22  DAL  CHH      118      107
1105 1990-04-22  CLE  NYK      115       99
1106 1990-04-22  GSW  SEA      124      122

[1107 rows x 5 columns]